Repository: kamenitxan/Farkle-PWA
Catalog: src/locale/messages.*.xlf
Languages: cs

source: End round
cs: Ukončit kolo

source: Roll again
cs: Házet znovu

source: Round
cs: Kolo

source: Selected
cs: Vybrané

source: Winner!
cs: Vítěz!

source: Player INTERPOLATION won with a score INTERPOLATION_1.
cs: Hráč INTERPOLATION vyhrál se skóre INTERPOLATION_1.

source: New game
cs: Nová hra

source: Game objective
cs: Cíl hry

source: The player who first reaches 2000 points wins. Players take turns rolling dice and collecting points for certain combinations.
cs: Zvítězí hráč, který první dosáhne 2000 bodů. Hráči si střídavě házejí kostkami a sbírají body za určité kombinace.

source: Scoring rules
cs: Pravidla bodování

source: " dispEnd="</strong>">1: 100 points
cs: " dispEnd="</strong>">1: 100 bodů

source: " dispEnd="</strong>">5: 50 points
cs: " dispEnd="</strong>">5: 50 bodů

source: " dispEnd="</strong>">Three 1s: 1000 points
cs: " dispEnd="</strong>">Tři 1: 1000 bodů

source: " dispEnd="</strong>">Full straight (1-2-3-4-5-6): 1500 points
cs: " dispEnd="</strong>">Plná postupka(1-2-3-4-5-6): 1500 bodů

source: " dispEnd="</strong>">Partial straight (1-2-3-4-5): 500 points
cs: " dispEnd="</strong>">Částečná postupka (1-2-3-4-5): 500 bodů

source: " dispEnd="</strong>">Partial straight (2-3-4-5-6): 750 points
cs: " dispEnd="</strong>">Částečná postupka (2-3-4-5-6): 750 bodů

source: Round procedure
cs: Průběh kola

source: Player rolls all 6 dice
cs: Hráč háže všemi 6 kostkami

source: Must select at least one scoring die
cs: Musí si vybrat alespoň jednu kostku s body

source: Selected dice are set aside and their points are added (round)
cs: Vybrané kostky se odloží a jejich body se sčítají (kolo)

source: Player can choose: " dispEnd="</ul>">" dispEnd="</li>">" dispEnd="</strong>">Continue: Roll remaining dice. If no points, loses all round points (farkle)" dispEnd="</li>">" dispEnd="</strong>">End: Take round points and end turn
cs: Hráč si může zvolit: " dispEnd="</ul>">" dispEnd="</li>">" dispEnd="</strong>">Pokračovat: Háže zbylými kostkami. Pokud nejsou body, ztrácí všechny body kola (farkle)" dispEnd="</li>">" dispEnd="</strong>">Skončit: Vezme si body z kola a končí

source: If player uses all dice, rolls again with all 6 dice (without losing points)
cs: Pokud hráč získá všechny kostky zpět, háže znovu se všemi 6 kostkami (bez ztráty bodů)

source: If a player has no scoring dice in their roll (no 1s, 5s, or combinations), they lose all points from the current round and their turn ends.
cs: Pokud hráč během kola nemá v házených kostkách žádné body (nejsou 1, 5 nebo kombinace), ztratí všechny body z aktuálního kola a jeho kolo skončí.

source: Player 1
cs: Hráč 1

source: Player 2
cs: Hráč 2

source: Target Score
cs: Konečné skóre

source: Save
cs: Uložit

# header.settings
source: Settings
cs: Nastavení

# header.rules
source: Rules
cs: Pravidla
